In [7]:
import pandas as pd
import numpy as np

In [30]:
df = pd.DataFrame({
    "key" : ["A","B",'C','A','B','C'],
    'value1' : range(6),
    'value2' : np.random.randint(0, 100, 6)
})

In [31]:
df

  key  value1  value2
0   A       0      62
1   B       1      73
2   C       2      10
3   A       3      40
4   B       4      17
5   C       5      37

In [33]:
# es como si pasaramos 3 dfs, el primero, se calculan sus medias por columna, y cada una de estas medias se restan a cada uno 
#de los vectores correspondientes
f.groupby('key').transform(lambda x: x-x.mean())

   value1  value2
0    -1.5    11.0
1    -1.5    28.0
2    -1.5   -13.5
3     1.5   -11.0
4     1.5   -28.0
5     1.5    13.5

# funcion agrregate

toma todos los agregados indicados sobre estructura de datos, en caso anterior se hizo una sola operacion, todo entre strings y sin su metodo, es decir la funcion directa

In [10]:
df.groupby('key').aggregate(["min", "median", "mean", "max"])

    value1                 value2
       min median mean max    min median  mean max
key
A        0    1.5  1.5   3     44   45.5  45.5  47
B        1    2.5  2.5   4     57   75.0  75.0  93
C        2    3.5  3.5   5     27   49.0  49.0  71

# aun mas especifico
se puede pasar diccionario indicanto que operacion(es) realizar a cada columna del df

In [11]:
df.groupby('key').aggregate({
    'value1' : ['min','max'],
    'value2' : 'max',
})

    value1     value2
       min max    max
key
A        0   3     47
B        1   4     93
C        2   5     71

# filter

In [12]:
#calculando std
df.groupby('key').std()

      value1     value2
key
A    2.12132   2.121320
B    2.12132  25.455844
C    2.12132  31.112698

In [21]:
df.groupby('key')['value2'].std()

key
A     2.121320
B    25.455844
C    31.112698
Name: value2, dtype: float64

In [28]:
df.groupby('key').value2.std() #otra forma, como en los df , parece que este tambien es un df

key
A     2.121320
B    25.455844
C    31.112698
Name: value2, dtype: float64

In [17]:
def filter_func(x):
    return x['value2'].std()>10

In [18]:
# es como si el groupby hiciera tres dataframes. luego calcula std de cada uno y da falso o verdadero
filter_func(df.groupby('key'))

key
A    False
B     True
C     True
Name: value2, dtype: bool

In [14]:
# para realizar operacion hay que alternar entre "" y '' para que todo sea naranaja , no funciona

display('df' , "df.groupby('key').std()" , "df.groupby('key').filter_func()")

'df'

"df.groupby('key').std()"

"df.groupby('key').filter_func()"

In [15]:
df.groupby('key').filter(filter_func)

  key  value1  value2
1   B       1      57
2   C       2      27
4   B       4      93
5   C       5      71

In [58]:
# mismo resultado con labda, x seran los tres df
df.groupby('key').filter(lambda x: x['value2'].std()>10 )

  key  value1  value2
0   A       0      19
1   B       1      40
3   A       3      64
4   B       4       5

Esta funciona filtra df  eliminando las filas pertenecientes al "factor" que no cumplen con la condici√≥n dada.

## transform

sirve cuando se quiere version reducida de los datos pero sin combinar, combinar datos de una forma

In [29]:
# funciona con lambda
df.groupby('key').transform(lambda x: x-x.mean())

   value1  value2
0    -1.5     1.5
1    -1.5   -18.0
2    -1.5   -22.0
3     1.5    -1.5
4     1.5    18.0
5     1.5    22.0

# apply
permite aplicar cualquier funcion a un conjunto de resultados, el parametro tiene que dser df y devuelve pandas, o bien series o escalar

In [65]:
# se realiza primero suma de columa value 2 y luego se divide a cada valor
def norm_by_col2(x):
    x['value1'] /= x['value2'].sum()
    return x

In [81]:
# esta funcion si altera datos sacar .copy()
norm_by_col2(df)

  key    value1  value2
0   A  0.000000      97
1   B  0.002857      81
2   C  0.005714      33
3   A  0.008571      53
4   B  0.011429      82
5   C  0.014286       4

notemos que en este caso se normalizo cada dato empleando la suma de toda la columna 2, mientras en que el siguiente, se realiza unicamente sumando por los respectivos "factores". permite realizar operaciones entre dos columnas

In [79]:
df.groupby('key').apply(norm_by_col2)

      key    value1  value2
key
A   0   A  0.000000      97
    3   A  0.020000      53
B   1   B  0.006135      81
    4   B  0.024540      82
C   2   C  0.054054      33
    5   C  0.135135       4

# entendiendo el groupby

en los casos desarrollados, lo que hace es "crear" 3 tablas para sus operaciones, de tal forma que resultan  tablas de la forma

A 

value 1 value 2
   0      70
   3      55

B

value 1 value 2

... 

de forma que las operaciones subsecuentes con apply transform o filter, se aplican a cada tabla

In [97]:
df

  key  value1  value2
0   A       0      70
1   B       1      70
2   C       2      63
3   A       3      55
4   B       4      42
5   C       5      36